# Divid a List into Two Columns DataFrame

In [25]:
import pandas as pd
import numpy as np

In [26]:
x = ['A',1,'B',2,'C',3,'D',4,'E',5]

In [27]:
english = []
number =[]

In [28]:
k = 0
for i in x:
    print (i)
    if k%2 == 0:
        english.append(i)
    else: 
        number.append(i)
    k+=1

A
1
B
2
C
3
D
4
E
5

In [29]:
even

  Eng
0   A
1   B
2   C
3   D
4   E

In [30]:
odd

   Num
0    1
1    2
2    3
3    4
4    5

In [31]:
even = pd.DataFrame(even)
even.columns = ['Eng']
even

  Eng
0   A
1   B
2   C
3   D
4   E

In [32]:
odd = pd.DataFrame(odd)
odd.columns = ['Num']
odd

   Num
0    1
1    2
2    3
3    4
4    5

In [33]:
pd.concat([even, odd],axis=1)

  Eng  Num
0   A    1
1   B    2
2   C    3
3   D    4
4   E    5